
// home work Bakay Andriy

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,S100,-18]та:
// let arr =[2,17,13,6,22,31,45,66,100,-18];
// ************************************************************************************
//     1. перебрати його циклом while
/*console.log("1. перебрати його циклом while");
let i = 0;
while(i<arr.length){
    console.log(arr[i]);
    i++;
}*/
// ************************************************************************************
//     2. перебрати його циклом for
/*console.log("2. перебрати його циклом for");
for (let i=0; i <arr.length; i++){
    console.log(arr[i]);
}*/
// ************************************************************************************
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
/*let i=0;
while(i<arr.length){
    if (i % 2 != 0){
        console.log(arr[i]);
    }
    i++;
}*/
// ************************************************************************************
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
/*let i=0;
while(i<arr.length){
    if (i % 2 == 0){
        console.log(arr[i]);
    }
    i++;
}*/
// ************************************************************************************
// 5. перебрати циклом while та вивести  числа тільки парні  значення
/*let i=0;
while(i<arr.length){
    if (arr[i] % 2 == 0){
        console.log(arr[i]);
    }
    i++;
}*/
// ************************************************************************************
// 6. перебрати циклом for та вивести  числа тільки парні  значення
/*for (let i=0; i <arr.length; i++){
    if (arr[i] % 2 == 0){
        console.log(arr[i]);
    }
}*/
// ************************************************************************************
// 7. замінити кожне число кратне 3 на слово "okten"
/*for (let i=0; i <arr.length; i++){
    if (arr[i] % 3 == 0){
        arr[i]="okten";
    }
    console.log(arr[i]);
}*/
// ************************************************************************************
// 8. вивести масив в зворотньому порядку.
/*for (let i=arr.length-1; i >= 0 ; i--){
    console.log(arr[i]);
}*/
// ************************************************************************************
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
/*let i = arr.length-1;
while(i>=0){
    console.log(arr[i]);
    i--;
}*/
// ************************************************************************************
/*for (let i=arr.length-1; i >=0; i--){
    console.log(arr[i]);
}*/
// ************************************************************************************
/*let i=arr.length-1;
while(i>=0){
    if (i % 2 != 0){
        console.log(arr[i]);
    }
    i--;
}*/
// ************************************************************************************
/*let i=arr.length-1;
while(i >= 0 ){
    if (i % 2 == 0){
        console.log(arr[i]);
    }
    i--;
}*/
// ************************************************************************************
// let i=arr.length-1;
// while(i>=0){
//     if (arr[i] % 2 == 0){
//         console.log(arr[i]);
//     }
//     i--;
// }
// ************************************************************************************
/*for (let i=0; i <arr.length; i++){
    if (arr[i] % 2 == 0){
        console.log(arr[i]);
    }
}*/
// ************************************************************************************
/*for (let i=0; i <arr.length; i++){
    if (arr[i] % 3 == 0){
        arr[i]="okten";
    }
    console.log(arr[i]);
}*/
// ************************************************************************************
// 10
// створити пустий масив та :
// let arrr = [];
// ************************************************************************************
//     - заповнити його 50 парними числами за допомоги циклу.
/*
let i = 0;
let count = 0;
while (true){
    if (i % 2 == 0){
        arrr.push(i);
        count+=1;
    }
    i++;
    if (count == 50){
        break;
    }
}
console.log(arrr);
*/

// ************************************************************************************
// - заповнити його 50 непарними числами за допомоги циклу.
/*let i = 0;
let count = 0;
while (true){
    if (i % 2 != 0){
        arrr.push(i);
        count+=1;
    }
    i++;
    if (count == 50){
        break;
    }
}
console.log(arrr);*/

// ************************************************************************************
// 1
// створити пустий масив та :
// let arrrr = [];
//     1. заповнити його 50 парними числами за допомоги циклу.
// зробив вище...
// 2. заповнити його 50 непарними числами за допомоги циклу.
// зробив вище...
// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
/*for (let i=0; i < 10; i++){
    let randomSource = Math.floor(Math.random() * 11);
    arrrr.push(randomSource);
}
console.log(arrrr);*/
// ************************************************************************************
//     диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
/*for (let i=0; i < 10; i++){
    let randomSource = Math.floor(Math.random() * 732) + 8;
    arrrr.push(randomSource);
}
console.log(arrrr);*/
// ************************************************************************************
// 2. вывести на консоль  каждый третий елемент
/*for (let i=0; i <arrrr.length; i++){
    if ((i+1) % 3 == 0){
        console.log(arrrr[i]);
    }
}*/
// ************************************************************************************
// 3. вывести на консоль  каждый третий елемент
// но при условии что его значение является парным.
/*for (let i=0; i <arrrr.length; i++){
    if ((i+1) % 3 == 0){
        if (arrrr[i] % 2 == 0) {
            console.log(arrrr[i]);
        }
    }
}*/
// ************************************************************************************
// 4. вывести на консоль  каждый третий елемент
// но при условии что он имеет парное значение и
// записать их в другой массив.
/*let arrrr2 =[];
for (let i=0; i <arrrr.length; i++){
    if ((i+1) % 3 == 0){
        if (arrrr[i] % 2 == 0) {
            console.log(arrrr[i]);
            arrrr2.push(arrrr[i])
        }
    }
}
console.log(arrrr2);*/
// ************************************************************************************
// 5. Вывести каждый елемент массива у которого соседний с права элемент - парный
/*for (let i=0; i <arrrr.length; i++){
    if (arrrr[i+1] % 2 == 0){
        console.log(arrrr[i]);
    }
}*/

// ************************************************************************************
// 5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
/*let chek = [100,250,50,168,120,345,188];
let sum = null;
let avarageChack = null;
for (let i=0; i <chek.length; i++){
    sum += chek[i];
}
console.log('середній чек:'+sum/chek.length);*/
// ************************************************************************************
// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
/*let arrrr = [];
let arrrr2 = [];
for (let i=0; i < 10; i++){
    let randomSource = Math.floor(Math.random() * 11);
    arrrr.push(randomSource);
}
console.log(arrrr);
for (let i=0; i < arrrr.length; i++){
    arrrr[i] *=5;
    arrrr2.push(arrrr[i]);
}
console.log(arrrr2);*/
// ************************************************************************************
// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
// додати його в інший масив.
/*
let array = ['hello', true, false, null, 10, 1, 0.5, 'apple'];
let array2 = [];
for (let i=0; i <array.length; i++){
    if (typeof array[i]  == 'number'){
        array2.push(array[i])
    }
}
console.log(array);
console.log(array2);*/
